app/controllers/api/albums_controller.rb

    def create
      @album = User.find(params[:id]).albums.new(album_params)
      if @album.save
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 4]]
INSERT INTO "albums" ("created_at", "owner_id", "title", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2015-02-05 02:29:35.249499"], ["owner_id", 4], ["title", "test"], ["updated_at", "2015-02-05 02:29:35.249499"]]

    def update
      @album = Album.find(params[:id])
      if @album.update_attributes(album_params)
---
SELECT  "albums".* FROM "albums"  WHERE "albums"."id" = $1 LIMIT 1  [["id", 60]]
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = 60  [["title", "blah, just use"], ["updated_at", "2015-02-06 01:51:22.176400"]]