app/controllers/api/photos_controller.rb

INSERT INTO "photos" ("caption", "created_at", "photo_url", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["caption", "test"], ["created_at", "2015-02-05 19:56:27.863279"], ["photo_url", "https://www.filepicker.io/api/file/WpSVZDv8SHiwF14jC3aD"], ["updated_at", "2015-02-05 19:56:27.863279"]]
---
    def create
      @photo = Photo.new(photo_params)
      if @photo.save

SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = $1 LIMIT 1  [["id", 12]]
DELETE FROM "photos" WHERE "photos"."id" = $1  [["id", 12]]
---
    def destroy
      @photo = Photo.find(params[:id])
      if editable?(@photo)
        @photo.destroy

SELECT  "photos".* FROM "photos"  WHERE "photos"."id" = $1 LIMIT 1  [["id", 34]]
UPDATE "photos" SET "cloudinary_id" = $1, "photo_url" = $2, "updated_at" = $3 WHERE "photos"."id" = 8  [["cloudinary_id", "ku-xlarge_jjf1t7"], ["photo_url", "http://res.cloudinary.com/devybncp2/image/upload/v1423273052/ku-xlarge_jjf1t7.jpg"], ["updated_at", "2015-02-07 01:37:13.009000"]]
---
    def update
      @photo = Photo.find(params[:id])
      if editable?(@photo)
        if @photo.update_attributes(photo_params)