app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if params[password_confirm] != user_params[password]
      flash.now[:errors] = ["Passwords don't match. Try again"]
      render :new
    elsif @user.save
---
INSERT INTO "users" ("created_at", "first_name", "last_name", "password_digest", "session_token", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"